## 10 minutes to Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Vamos a crear una serie. Es decir un vector de números
s = pd.Series([1,3,5,np.nan,6,8]) # Note que usamos la fun pd y el método .Series
# La sintaxis que se usa es como una lista. .nan es es NA

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
# Vamos a crear un df con fechas.
dates = pd.date_range("20130101", periods = 7) #fecha inicial y cuantos periodos más

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(7,4), index = dates, columns = list("ABCD"))
# Lo que hace este codigo es crearme un df cuyos valores en filas columnas sean una distribución normal. En cuyas filas vayan las fechas

In [10]:
df

                   A         B         C         D
2013-01-01 -0.804211  0.543670  0.029362 -1.014812
2013-01-02 -1.607454 -2.013982 -0.932116  0.274283
2013-01-03 -0.340127  0.111824  0.602054 -0.300200
2013-01-04  0.574136 -0.062247  0.051862  1.412656
2013-01-05  1.437022  0.366983  0.074115 -0.745942
2013-01-06 -0.411261 -0.292227  0.854349  0.493675
2013-01-07  0.860853 -0.200088 -1.597366  0.446899

In [11]:
# Se pueden trabajar como diccionarios.
# Cada llave es una columna.
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'), # crea la misma fecha
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'), # Para poner el mismo número
                    'D': np.array([3] * 4, dtype='int32'), # Para poner el mismo número
                    'E': pd.Categorical(["test", "train", "test", "train"]), # Difrentes valores
                    'F': 'foo'}) # El mismo valor

In [12]:
df2.dtypes # Es como un describe en Stata. Me dice el tipo de tipos.

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### Visualizar datos

In [13]:
df.head() # Los primeros 5 por defecto, pero puedo poner el número que quiera

                   A         B         C         D
2013-01-01 -0.804211  0.543670  0.029362 -1.014812
2013-01-02 -1.607454 -2.013982 -0.932116  0.274283
2013-01-03 -0.340127  0.111824  0.602054 -0.300200
2013-01-04  0.574136 -0.062247  0.051862  1.412656
2013-01-05  1.437022  0.366983  0.074115 -0.745942

In [14]:
df.tail(4) # Los últimos 4

                   A         B         C         D
2013-01-04  0.574136 -0.062247  0.051862  1.412656
2013-01-05  1.437022  0.366983  0.074115 -0.745942
2013-01-06 -0.411261 -0.292227  0.854349  0.493675
2013-01-07  0.860853 -0.200088 -1.597366  0.446899

In [15]:
# ¿Cuáles son las filas? o El nombre de las filas
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [16]:
# ¿Cuáles son las columnas? o El nombre de las columnas
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
# Se pueden pasar los datos de un dataframe a numpy
df.to_numpy()

array([[-0.8042108 ,  0.54367033,  0.02936152, -1.01481168],
       [-1.60745401, -2.01398177, -0.93211579,  0.27428338],
       [-0.34012737,  0.11182438,  0.60205397, -0.30020042],
       [ 0.57413587, -0.06224747,  0.05186226,  1.41265593],
       [ 1.43702213,  0.36698279,  0.07411473, -0.74594238],
       [-0.41126095, -0.29222653,  0.85434914,  0.49367539],
       [ 0.86085285, -0.20008838, -1.59736608,  0.44689909]])

In [18]:
df2.to_numpy() # Note que es más grande.

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

#### Summary of my data

In [19]:
df.describe() # Estadística descriptiva básica.

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean  -0.041577 -0.220867 -0.131106  0.080937
std    1.051912  0.845253  0.856497  0.831144
min   -1.607454 -2.013982 -1.597366 -1.014812
25%   -0.607736 -0.246157 -0.451377 -0.523071
50%   -0.340127 -0.062247  0.051862  0.274283
75%    0.717494  0.239404  0.338084  0.470287
max    1.437022  0.543670  0.854349  1.412656

In [20]:
# Transponer
df.T

,2013-01-01,2013-01-02,2013-01-03,2013-01-04,2013-01-05,2013-01-06,2013-01-07
A,-0.804211,-1.607454,-0.340127,0.574136,1.437022,-0.411261,0.860853
B,0.543670,-2.013982,0.111824,-0.062247,0.366983,-0.292227,-0.200088
C,0.029362,-0.932116,0.602054,0.051862,0.074115,0.854349,-1.597366
D,-1.014812,0.274283,-0.300200,1.412656,-0.745942,0.493675,0.446899

In [21]:
# Ordenera
df.sort_index(axis = 1, ascending = False) # 1 para Col 0 para Filas

                   D         C         B         A
2013-01-01 -1.014812  0.029362  0.543670 -0.804211
2013-01-02  0.274283 -0.932116 -2.013982 -1.607454
2013-01-03 -0.300200  0.602054  0.111824 -0.340127
2013-01-04  1.412656  0.051862 -0.062247  0.574136
2013-01-05 -0.745942  0.074115  0.366983  1.437022
2013-01-06  0.493675  0.854349 -0.292227 -0.411261
2013-01-07  0.446899 -1.597366 -0.200088  0.860853

In [22]:
df.sort_values(by='B') # Por defecto lo hacer ascendente

                   A         B         C         D
2013-01-02 -1.607454 -2.013982 -0.932116  0.274283
2013-01-06 -0.411261 -0.292227  0.854349  0.493675
2013-01-07  0.860853 -0.200088 -1.597366  0.446899
2013-01-04  0.574136 -0.062247  0.051862  1.412656
2013-01-03 -0.340127  0.111824  0.602054 -0.300200
2013-01-05  1.437022  0.366983  0.074115 -0.745942
2013-01-01 -0.804211  0.543670  0.029362 -1.014812

### Seleccionar

In [23]:
df["A"] # El indice siempre se queda, lo que vamos a seleccionar son las otras columnas.

2013-01-01   -0.804211
2013-01-02   -1.607454
2013-01-03   -0.340127
2013-01-04    0.574136
2013-01-05    1.437022
2013-01-06   -0.411261
2013-01-07    0.860853
Freq: D, Name: A, dtype: float64

In [25]:
df[0:3] # Filas.

                   A         B         C         D
2013-01-01 -0.804211  0.543670  0.029362 -1.014812
2013-01-02 -1.607454 -2.013982 -0.932116  0.274283
2013-01-03 -0.340127  0.111824  0.602054 -0.300200

In [26]:
df.loc[dates[0]] # Todos los valores cuando dates[0]

A   -0.804211
B    0.543670
C    0.029362
D   -1.014812
Name: 2013-01-01 00:00:00, dtype: float64

In [28]:
 df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -1.607454 -2.013982
2013-01-03 -0.340127  0.111824
2013-01-04  0.574136 -0.062247

In [29]:
df.loc['20130102', ['A', 'B']]

A   -1.607454
B   -2.013982
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
# Seleccionar por posición
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.574136 -0.062247
2013-01-05  1.437022  0.366983

In [34]:
df.iloc[3:4]

                   A         B         C         D
2013-01-04  0.574136 -0.062247  0.051862  1.412656

In [35]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.607454 -0.932116
2013-01-03 -0.340127  0.602054
2013-01-05  1.437022  0.074115

In [36]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.607454 -2.013982 -0.932116  0.274283
2013-01-03 -0.340127  0.111824  0.602054 -0.300200

In [37]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.543670  0.029362
2013-01-02 -2.013982 -0.932116
2013-01-03  0.111824  0.602054
2013-01-04 -0.062247  0.051862
2013-01-05  0.366983  0.074115
2013-01-06 -0.292227  0.854349
2013-01-07 -0.200088 -1.597366

In [38]:
df.iloc[1, 1]

-2.013981772509375

In [39]:
df.iat[1, 1]

-2.013981772509375

In [40]:
# Condicionales
df[df['A'] > 0] # Me muestra los que son > en A

                   A         B         C         D
2013-01-04  0.574136 -0.062247  0.051862  1.412656
2013-01-05  1.437022  0.366983  0.074115 -0.745942
2013-01-07  0.860853 -0.200088 -1.597366  0.446899

In [41]:
df[df > 0] # Solo aparecen los de la base de datos, el resto Na

                   A         B         C         D
2013-01-01       NaN  0.543670  0.029362       NaN
2013-01-02       NaN       NaN       NaN  0.274283
2013-01-03       NaN  0.111824  0.602054       NaN
2013-01-04  0.574136       NaN  0.051862  1.412656
2013-01-05  1.437022  0.366983  0.074115       NaN
2013-01-06       NaN       NaN  0.854349  0.493675
2013-01-07  0.860853       NaN       NaN  0.446899

In [44]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three',"five"]
df2

                   A         B         C         D      E
2013-01-01 -0.804211  0.543670  0.029362 -1.014812    one
2013-01-02 -1.607454 -2.013982 -0.932116  0.274283    one
2013-01-03 -0.340127  0.111824  0.602054 -0.300200    two
2013-01-04  0.574136 -0.062247  0.051862  1.412656  three
2013-01-05  1.437022  0.366983  0.074115 -0.745942   four
2013-01-06 -0.411261 -0.292227  0.854349  0.493675  three
2013-01-07  0.860853 -0.200088 -1.597366  0.446899   five

In [45]:
df2[df2['E'].isin(['two', 'four'])] # Si la columna E es igual a _ _

                   A         B         C         D     E
2013-01-03 -0.340127  0.111824  0.602054 -0.300200   two
2013-01-05  1.437022  0.366983  0.074115 -0.745942  four

In [46]:
df.at[dates[0], 'A'] = 0 # Cambiar valores

In [47]:
df.iat[0, 1] = 0